app/views/genres/show.html.erb

<%=@genre.name%>
<%@genre.menus.each do |menu|%>
---
SELECT "menus".* FROM "menus" WHERE "menus"."genre_id" = ?  [["genre_id", 1]]