app/views/menus/index.html.erb

<%=tag.name %>
<%="(#{tag.menus.count})" %><% end %>
---
SELECT "menus".* FROM "menus"
SELECT COUNT(*) FROM "menus" INNER JOIN "menu_tags" ON "menus"."id" = "menu_tags"."menu_id" WHERE "menu_tags"."tag_id" = ?  [["tag_id", 1]]

<% @menus.each do |menu| %>
<i class="fas fa-tag"><%= menu.tags.map(&:name).join(', ') %></i>
---
SELECT "tags".* FROM "tags" INNER JOIN "menu_tags" ON "tags"."id" = "menu_tags"."tag_id" WHERE "menu_tags"."menu_id" = ?  [["menu_id", 1]]