app/views/menus/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "menu_tags" ON "tags"."id" = "menu_tags"."tag_id" WHERE "menu_tags"."menu_id" = ?  [["menu_id", 7]]
SELECT COUNT(*) FROM "menus" INNER JOIN "menu_tags" ON "menus"."id" = "menu_tags"."menu_id" WHERE "menu_tags"."tag_id" = ?  [["tag_id", 1]]
---
<%=@menu.title%>
<% @menu.tags.each do |tag| %>
  <%=tag.name%><%="(#{tag.menus.count})" %>