app/views/users/show.html.erb


<%@user.menus.each do |menu| %>
---
SELECT "menus".* FROM "menus" WHERE "menus"."user_id" = ?  [["user_id", 1]]