app/controllers/genres_controller.rb

    def show
        @genre = Genre.find(params[:id])
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]