app/controllers/menus_controller.rb

    def index
        @menus = Menu.all
        @tags = Tag.all
---
SELECT "menus".* FROM "menus"
SELECT "tags".* FROM "tags"

    def show
        @menu = Menu.find(params[:id])
        @tag_list=@menu.tags.pluck(:name).join(',')
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "tags"."name" FROM "tags" INNER JOIN "menu_tags" ON "tags"."id" = "menu_tags"."tag_id" WHERE "menu_tags"."menu_id" = ?  [["menu_id", 7]]

    def create
        @menu = Menu.new(menu_params)
        @menu.user_id = current_user.id
        @menu.genre_id = 1
        if @menu.user != current_user
            redirect_to user_path(current_user)
        end
        tag_list=params[:menu][:tag_name].split(',')
        if @menu.save
            tag_list.each do |tag|
                new_menu_tag = Tag.find_or_create_by(name: tag)
                @menu.tags << new_menu_tag
---
INSERT INTO "menus" ("user_id", "genre_id", "title", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["genre_id", 1], ["title", "test"], ["caption", "test"], ["created_at", "2022-07-03 12:03:14.897516"], ["updated_at", "2022-07-03 12:03:14.897516"]]
INSERT INTO "menu_tags" ("menu_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["menu_id", 7], ["tag_id", 1], ["created_at", "2022-07-03 12:14:20.582714"], ["updated_at", "2022-07-03 12:14:20.582714"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tag1"], ["created_at", "2022-07-03 12:12:14.007006"], ["updated_at", "2022-07-03 12:12:14.007006"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "tag1"], ["LIMIT", 1]]

    def edit
        @menu = Menu.find(params[:id])
        @tags = @menu.tags.pluck(:name).join(',')
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "tags"."name" FROM "tags" INNER JOIN "menu_tags" ON "tags"."id" = "menu_tags"."tag_id" WHERE "menu_tags"."menu_id" = ?  [["menu_id", 7]]

    def update
        @menu = Menu.find(params[:id])
        @menu.genre_id = 1
        tag_list=params[:menu][:tag_name].split(',')
        if @menu.user != current_user
            redirect_to user_path(current_user)
        elsif @menu.update(menu_params)
            @menu.save_tag(tag_list)
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "menus" SET "title" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["title", "testaa"], ["updated_at", "2022-07-03 12:16:44.769442"], ["id", 7]]