app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test"], ["introduction", "i am a test user"], ["updated_at", "2022-07-03 10:11:03.339863"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user != current_user
            redirect_to user_path(current_user)
        end

        if @user.update(user_params)