app/models/menu.rb

     def save_tag(sent_tags)
        current_tags = self.tags.pluck(:name)
        old_tags = current_tags - sent_tags
        new_tags = sent_tags - current_tags

        old_tags.each do |old|
            self.tags.delete　Tag.find_by(name: old)
        end

        new_tags.each do |new|
            new_menu_tag = Tag.find_or_create_by(name: new)
            self.tags << new_menu_tag
---
SELECT "tags"."name" FROM "tags" INNER JOIN "menu_tags" ON "tags"."id" = "menu_tags"."tag_id" WHERE "menu_tags"."menu_id" = ?  [["menu_id", 7]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tag3"], ["created_at", "2022-07-03 12:16:44.812195"], ["updated_at", "2022-07-03 12:16:44.812195"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "tag3"], ["LIMIT", 1]]
INSERT INTO "menu_tags" ("menu_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["menu_id", 7], ["tag_id", 3], ["created_at", "2022-07-03 12:16:44.846035"], ["updated_at", "2022-07-03 12:16:44.846035"]]